import requests
from bs4 import BeautifulSoup
import re
import words, simplify, cyrillic, scripts

cache = {}

OBSCENE_WORDS = [
    "ебать", "ебу", "ебешь", "ебет", "ебем", "ебете", "ебут",
    "ебал", "ебала", "ебало", "ебали", "ебать", "ебал", "ебала", "ебало", "ебали", "ебу",
    "ебем", "ебете", "ебут", "ебат", "ебись", "ебется", "ебаный", "ебучий", "ебаная", "ебаное",
    "ебаные", "ебаных", "ебаному", "ебаным", "ебаного", "ебаной", "ебаную", "ебаными", "ебанах",
    "хуй", "хуя", "хую", "хуем", "хуи", "хуев", "хуями", "хуях", "хуйня", "хуйни", "хуйню", "хуйне",
    "хуйней", "хуйню", "хуйней", "хуями", "хуевым", "хуевыми", "хуевое", "хуевой", "хуевом", "хуевому",
    "хуевыми", "хуевый", "хуевым", "хуевые", "хуевых", "хуево", "хуевая", "хуевое", "хуевую",
    "хуевый", "хуевые", "хуевых", "хуевым", "хуевыми", "пизда", "пизды", "пизде", "пиздой", "пизду",
    "пизды", "пиздам", "пиздами", "пиздах", "пизду", "пизды", "пиздой", "пизде", "пизду", "пизды",
    "пиздам", "пиздою", "пиздами", "пиздах", "пиздеть", "пиздишь", "пиздит", "пиздим", "пиздите",
    "пиздят", "пиздел", "пиздела", "пиздело", "пиздели", "пизди", "пиздить", "пиздишь", "пиздит",
    "пиздим", "пиздите", "пиздят", "пиздел", "пиздела", "пиздело", "пиздели", "блядь", "бляди",
    "бляди", "блядей", "блядям", "блядями", "блядях", "бляди", "блядь", "блядью", "блядям",
    "блядях", "блядство", "блядства", "блядстве", "блядству", "блядством", "блядств", "блядствующий",
    "блядствующая", "блядствующее", "блядствующие", "блядствующего", "блядствующей", "блядствующим",
    "блядствующего", "блядствующую", "блядствующей", "блядствующем", "блядствующего", "блядствующим",
    "блядствующими", "блядствующих",
    "бля", "бляха", "блять", "блядский", "блядская", "блядское", "блядские", "блядских", "блядскому",
    "блядским", "блядского", "блядской", "блядскую", "блядскими", "блядских",
    "нихуя", "нихуя себе", "нихуя не", "нихуевый", "нихуёво", "нихуёвый", "нихуёвого", "нихуёвое", "нихуёвым", "нихуёвому",
    "нихуёвым", "нихуёвые", "нихуёвых", "нихуёвым", "нихуёвыми", "нихуёвых", 'залупами', 'залупам', 'залупу', 'залупы', 'залупе', 'залупе', 'залупах', 'залупой', 'залупах', 'залупа',
    'залуп', 'залупы', 'залупами', 'залупах', 'залупе', 'залупные', 'залупах', 'залупной', 'залупных'
    'залупка', 'залупки', 'залупке', 'залупкой','залупкам', 'залупку', 'залупки', 'залупок', 'залупкам', 'залупками','залупках', 'залупный', 'залупного','залупным','залупное','залупная'
]

DATA = ['ху', 'еб', 'пизд','бл', 'залуп']


def request(word):
    if word in cache:
        return cache[word]
    url = f"https://ru.wiktionary.org/wiki/{word}"
    response = requests.get(url)
    cache[word] = response
    return response

def is_word_obscene(word):
    word = cyrillic.translit_to_cyrillic(word).lower()
    if word in OBSCENE_WORDS or 'залуп' in word:
        return True
    word = words.get_initial_form(simplify.simplify_word(word))
    response = request(word)

    if response.status_code != 200:
        for elem in DATA:
            if elem in word:
                return True
        return False

    soup = BeautifulSoup(response.content, 'html.parser')
    new_text = []

    for elem in soup.text.split("\n"):
        if elem == "Синонимы":
            break
        else:
            if elem != "":
                new_text.append(elem)

    new_text = "\n".join(new_text)

    pattern = r'([^.]*?обсц[^.]*\.)'
    matches = re.findall(pattern, new_text, re.IGNORECASE)


    return bool(matches)

